# Taps
tap "1password/tap"
tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "danielbayley/music"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "lautis/refined-github-safari"
tap "majd/repo"
tap "microsoft/git"
tap "thiskevinwang/tk", "https://github.com/thiskevinwang/tk"

# Fonts
cask "font-fira-code-nerd-font"

# Binaries
brew "autojump"
brew "automake"
brew "coreutils"
brew "curl"
brew "dark-mode"
brew "docker-compose"
brew "fakeroot"
brew "fd"
brew "flac"
brew "fontconfig"
brew "git"
brew "gnutls"
brew "go"
brew "gradle"
brew "highlight"
brew "mackup"
brew "node"
brew "php"
brew "pipenv"
brew "pkg-config"
brew "pnpm"
brew "postgresql"
brew "prettier"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "switchaudio-osx"
brew "tag"
brew "tcl-tk"
brew "thefuck"
brew "thiskevinwang/tk/tk"
brew "tree"
brew "unbound"
brew "vite"
brew "watchman"
brew "webp"
brew "wget"
brew "yarn"

# Apps
cask "1password"
cask "1password-cli"
cask "ableton-live-suite"
cask "ableton-live-theme-dracula"
cask "airpass"
cask "alfred"
cask "app-tamer"
cask "appdelete"
cask "archiver"
cask "arq"
cask "background-music"
cask "bartender"
cask "batchmod"
cask "bettertouchtool"
cask "betterzipql"
cask "carbon-copy-cloner"
cask "cleanshot"
cask "codekit"
cask "coderunner"
cask "cookie"
cask "discord"
cask "docker"
cask "dockmate"
cask "dockview"
cask "dropbox"
cask "fig"
cask "firefox"
cask "gas-mask"
cask "git-credential-manager-core"
cask "google-chrome"
cask "hazel"
cask "ipatool"
cask "iterm2"
cask "izotope-product-portal"
cask "jettison"
cask "kaleidoscope"
cask "loom"
cask "nosql-workbench"
cask "notion"
cask "open-in-code"
cask "pacifist"
cask "postman"
cask "raycast"
cask "rectangle-pro"
cask "resilio-sync"
cask "scriptql"
cask "setapp"
cask "shortcat"
cask "sketch"
cask "sketch-toolbox"
cask "slack"
cask "splice"
cask "spotify"
cask "sublime-text"
cask "suspicious-package"
cask "tableplus"
cask "telegram"
cask "temurin"
cask "textbuddy"
cask "textexpander"
cask "trackerzapper"
cask "upic"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
cask "activedock"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "bitwig-studio"
cask "cakebrew"
cask "gitup"
cask "gray"
cask "iconjar"
cask "imageoptim"
cask "keka"
cask "micro-snitch"
cask "multitouch"
cask "numi"
cask "platypus"
cask "popmaker"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "recordit"
cask "refined-github-safari"
cask "rightfont"
cask "webpquicklook"

#Mac App Store Apps
mas "1Password for Safari", id: 1569813296
mas "Action Shortcuts", id: 1447884454
mas "Affiliate", id: 789724698
mas "Affinity Photo", id: 824183456
mas "Airmail", id: 918858936
mas "AliasManager", id: 920141656
mas "Amphetamine", id: 937984704
mas "Ample", id: 1512016255
mas "Any.do", id: 944960179
mas "Apple Configurator", id: 1037126344
mas "ArtNetView", id: 1439166791
mas "AudioCipher", id: 1526615001
mas "AudioCortex", id: 1478349000
mas "AudioSwitcher", id: 1484150558
mas "Backtrack", id: 1477089520
mas "Balance Lock", id: 1019371109
mas "Bear", id: 1091189122
mas "Blik", id: 955293604
mas "Browser Ninja", id: 995838410
mas "CalcService", id: 899970159
mas "Capture Midi", id: 766655598
mas "Cardhop", id: 1290358394
mas "CARROT Weather", id: 993487541
mas "Charmstone", id: 1563735522
mas "CleanMyDrive 2", id: 523620159
mas "ColorKit", id: 941186109
mas "ColorSlurp", id: 1287239339
mas "Command E", id: 1570339016
mas "Controller", id: 1198176727
mas "Cookie", id: 1473091386
mas "Craft", id: 1487937127
mas "Crontab Creator", id: 1438725196
mas "CSS Selector", id: 934600297
mas "CurrentKey Stats", id: 1456226992
mas "Cursor Pro", id: 1447043133
mas "DACorum", id: 1584715126
mas "DaftCloud", id: 1320450034
mas "DaisyDisk", id: 411643860
mas "Dark Reader for Safari", id: 1438243180
mas "DebugHelper", id: 770159891
mas "DeepLinkr", id: 1586244217
mas "Deliveries", id: 924726344
mas "Denied", id: 909257784
mas "DEVONagent Pro", id: 450113817
mas "DEVONsphere Express", id: 501020582
mas "Display Maid", id: 450063525
mas "djay Pro AI", id: 450527929
mas "Easy Script Copier", id: 765947254
mas "FilePane", id: 847515307
mas "Follow the Sun Helper", id: 1545131600
mas "FruitJuice", id: 671736912
mas "FSNotes", id: 1277179284
mas "Gestimer", id: 990588172
mas "Getfiles", id: 965885090
mas "Glasp - Social Web Highlighter", id: 1605690124
mas "Grand Piano Keys", id: 1049623607
mas "HazeOver", id: 430798174
mas "HEIC Converter", id: 1294126402
mas "Home Assistant", id: 1099568401
mas "HomeCam", id: 1292995895
mas "HomeControl", id: 1547121417
mas "HomePass", id: 1330266650
mas "Hush", id: 1544743900
mas "Icon Slate", id: 439697913
mas "Image Vectorizer", id: 789656124
mas "ImageGlitch", id: 417423725
mas "ImageGlitcher", id: 1491618525
mas "ImageJoiner", id: 1006127937
mas "InfinityMonitor", id: 894419406
mas "InstantCircleOfFifths", id: 1082891202
mas "InYourFace", id: 1476964367
mas "JSON Edit", id: 1084994075
mas "Key Codes", id: 414568915
mas "KeyBud", id: 1203851191
mas "KeyLimePie", id: 1575163350
mas "Levelator", id: 1493326487
mas "Little Tagger", id: 1561643278
mas "Livedesk for Facebook Live", id: 1187930336
mas "Livedesk Studio", id: 1217841826
mas "Logic Pro", id: 634148309
mas "Magic Media Marker", id: 438852954
mas "MailChimp Import", id: 451733304
mas "MailSpy", id: 957859721
mas "Marked 2", id: 890031187
mas "Mate Translate", id: 1005088137
mas "Maxel Downloader", id: 837352001
mas "MediaInfo", id: 510620098
mas "MenubarX", id: 1575588022
mas "Meta", id: 558317092
mas "MetaDoctor Pro", id: 992000603
mas "MetaMovie", id: 511114225
mas "MetaTV", id: 590518045
mas "MetroKit", id: 1053196425
mas "Metronome X", id: 1222424189
mas "MickTagger", id: 1490366427
mas "MIDI Keyboard", id: 1221266801
mas "MIDI Thru", id: 873634211
mas "MIDIEcho", id: 513536866
mas "MidiFXFreezeApp", id: 1475527978
mas "MIDIPlayer X", id: 954177929
mas "miRack", id: 1468259834
mas "musicMath", id: 882481940
mas "Name Mangler", id: 603637384
mas "Neural Mix Pro", id: 1527105121
mas "OneTab", id: 1540160809
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Peek", id: 1554235898
mas "Permute 3", id: 1444998321
mas "Pi-hole Remote", id: 1515445551
mas "Plash", id: 1494023538
mas "Plisterine", id: 634210019
mas "PopClip", id: 445189367
mas "Power JSON Editor", id: 499768540
mas "Power On Time", id: 1134653998
mas "QuickMIDI", id: 1459790045
mas "RapidClick", id: 419891002
mas "rcmd", id: 1596283165
mas "Reacting Live", id: 1510179491
mas "RSS Bot", id: 605732865
mas "Samplism", id: 1034950576
mas "Scenecuts Helper", id: 1540491573
mas "Screenshots", id: 596575437
mas "Shazam", id: 897118787
mas "Short Menu", id: 510109287
mas "ShortStop", id: 456212872
mas "SinriMailTextPost", id: 1471499833
mas "Slack", id: 803453959
mas "Smart Converter Pro 2", id: 660234210
mas "Smarts", id: 438671026
mas "SnippetsLab", id: 1006087419
mas "Soundcoder", id: 1541045944
mas "Splash Pro", id: 1497060783
mas "SpyLab", id: 1054779315
mas "start", id: 1329701389
mas "StartUp", id: 1452212620
mas "Statistical Calculations", id: 1076180705
mas "StreamByter", id: 1440282099
mas "Suggester", id: 1106482294
mas "Symbolic Linker", id: 1435106536
mas "SyncSettings", id: 1438001736
mas "Tailscale", id: 1475387142
mas "Text Compare", id: 1552247688
mas "Text2Speech", id: 467038962
mas "TextLab", id: 1024903185
mas "TextScrub", id: 600842582
mas "TextSer", id: 1057099849
mas "Things", id: 904280696
mas "TidyAgent", id: 1490212946
mas "TimeCode Monitor", id: 1527149877
mas "TrackSift 2", id: 908737079
mas "Trimmer", id: 1037828753
mas "Tweetbot", id: 1384080005
mas "TweetShot", id: 1227057295
mas "Type2Phone", id: 472717129
mas "Unclutter", id: 577085396
mas "uPic", id: 1549159979
mas "Utility", id: 1027541844
mas "Vector Convert X", id: 1459278881
mas "Vector Converter", id: 1082712391
mas "VersionsManager", id: 1060151161
mas "Video Doctor", id: 1492318174
mas "Vimari", id: 1480933944
mas "VisualDiffer", id: 412386481
mas "web-midi", id: 1507500927
mas "Webarchive to HTML", id: 844587292
mas "WebBuddy", id: 525308400
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723
mas "Wipr", id: 1320666476
mas "WordService", id: 899972312
mas "XML Notepad", id: 604275546
mas "XML-2-JSON", id: 942371633
mas "xSearch", id: 1579902068
mas "Xcode", id: 497799835